; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v6 - type_3 ?v7 - type_2)
 	      (pred_4 ?v5 - object ?v7 - type_2)
	      (pred_2 ?v6 - type_3 ?v4 - type_1)
	      (pred_3 ?v6 - type_3 ?v5 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v6 - type_3 ?v3 ?v1 - type_2)
       :precondition (and  (pred_1 ?v6 ?v3))
       :effect (and  (pred_1 ?v6 ?v1)
		     (not (pred_1 ?v6 ?v3))))

   (:action op_2
       :parameters (?v6 - type_3 ?v8 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v8 ?v2) (pred_1 ?v6 ?v2) (pred_2 ?v6 ?v4))
       :effect (and (pred_3 ?v6 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v2)) 
		    (not (pred_2 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_3 ?v8 - object ?v2 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v8 ?v4) (pred_1 ?v6 ?v2))
       :effect (and (pred_4 ?v8 ?v2)
		    (pred_2 ?v6 ?v4)
		    (not (pred_3 ?v6 ?v8 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_02 - type_3
obj_03 obj_09 obj_14 obj_05 - type_1
obj_12 obj_13 obj_11 obj_06 - type_2
obj_01 obj_08 obj_07 obj_10 - object)
(:init
(pred_1 obj_04 obj_06)
(pred_2 obj_04 obj_03)
(pred_2 obj_04 obj_09)
(pred_1 obj_02 obj_11)
(pred_2 obj_02 obj_14)
(pred_2 obj_02 obj_05)
(pred_4 obj_01 obj_12)
(pred_4 obj_08 obj_13)
(pred_4 obj_07 obj_12)
(pred_4 obj_10 obj_12)
)
(:goal
(and
(pred_4 obj_01 obj_11)
(pred_4 obj_08 obj_06)
(pred_4 obj_07 obj_06)
(pred_4 obj_10 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_04 obj_11) (pred_1 obj_02 obj_11))))
    (always (not (and (pred_1 obj_04 obj_06) (pred_1 obj_02 obj_06))))
  )
)
)

; plan
1. (op_3 obj_04 obj_06 obj_13)
   deleted: (pred_1 obj_04 obj_06)
   added: (pred_1 obj_04 obj_13)
   goals met: 1 of 4
2. (op_3 obj_02 obj_11 obj_13)
   deleted: (pred_1 obj_02 obj_11)
   added: (pred_1 obj_02 obj_13)
   goals met: 1 of 4
3. (op_2 obj_04 obj_08 obj_13 obj_09)
   deleted: (pred_4 obj_08 obj_13) (pred_2 obj_04 obj_09)
   added: (pred_3 obj_04 obj_08 obj_09)
   goals met: 1 of 4
4. (op_3 obj_02 obj_13 obj_06)
   deleted: (pred_1 obj_02 obj_13)
   added: (pred_1 obj_02 obj_06)
   goals met: 1 of 4
5. (op_3 obj_04 obj_13 obj_12)
   deleted: (pred_1 obj_04 obj_13)
   added: (pred_1 obj_04 obj_12)
   goals met: 1 of 4
6. (op_3 obj_02 obj_06 obj_12)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_12)
   goals met: 1 of 4
7. (op_2 obj_04 obj_07 obj_12 obj_03)
   deleted: (pred_4 obj_07 obj_12) (pred_2 obj_04 obj_03)
   added: (pred_3 obj_04 obj_07 obj_03)
   goals met: 1 of 4
8. (op_2 obj_02 obj_01 obj_12 obj_05)
   deleted: (pred_4 obj_01 obj_12) (pred_2 obj_02 obj_05)
   added: (pred_3 obj_02 obj_01 obj_05)
   goals met: 1 of 4
9. (op_3 obj_02 obj_12 obj_11)
   deleted: (pred_1 obj_02 obj_12)
   added: (pred_1 obj_02 obj_11)
   goals met: 1 of 4
10. (op_3 obj_04 obj_12 obj_06)
   deleted: (pred_1 obj_04 obj_12)
   added: (pred_1 obj_04 obj_06)
   goals met: 1 of 4
11. (op_1 obj_04 obj_07 obj_06 obj_03)
   deleted: (pred_3 obj_04 obj_07 obj_03)
   added: (pred_4 obj_07 obj_06) (pred_2 obj_04 obj_03)
   goals met: 2 of 4
12. (op_1 obj_04 obj_08 obj_06 obj_09)
   deleted: (pred_3 obj_04 obj_08 obj_09)
   added: (pred_4 obj_08 obj_06) (pred_2 obj_04 obj_09)
   goals met: 3 of 4
13. (op_1 obj_02 obj_01 obj_11 obj_05)
   deleted: (pred_3 obj_02 obj_01 obj_05)
   added: (pred_4 obj_01 obj_11) (pred_2 obj_02 obj_05)
   goals met: 4 of 4
